app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 3], ["id", 3], ["LIMIT", 1]]
---
  def show
    @posts = current_user.posts.all

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?)
---
  def create
  	@post = Post.new(post_params)
  	if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 21], ["LIMIT", 1]]
UPDATE "posts" SET "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image", "komaru.jpg"], ["updated_at", "2018-07-18 11:06:22.648646"], ["id", 38]]
---
  def update
  	@post = current_user.posts.find(params[:id])
  	if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 22], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 22]]
---
  def destroy
  	@post = current_user.posts.find(params[:id])
  	@post.destroy